Repository: 2br-2b/Tiling-Assistant
Catalog: translations/*.po
Languages: cs

source: Tiling-assistant's popup enabled
cs: Vyskakovací okno Asistenta dlaždicování povoleno

source: Tiling-assistant's popup was disabled
cs: Vyskakovací okno Asistenta dlaždicování bylo zakázáno

source: Can't enter 'Tile Editing Mode', if the focused window isn't tiled.
cs: Nelze přejít do režimu úprav dlaždic, pokud zaměřené okno není dlaždice.

source: Toggle 'Maximize'
cs: Přepnout "Maximalizovat"

source: Minimize window
cs: Minimalizovat okno

source: Close window
cs: Zavřít okno

source: Move to previous workspace
cs: Přesunout na předchozí pracovní plochu

source: Move to next workspace
cs: Přesunout na následující pracovní plochu

source: Move to top monitor
cs: Přesunout na horní monitor

source: Move to bottom monitor
cs: Přesunout na spodní monitor

source: Move to left monitor
cs: Přesunout na levý monitor

source: Move to right monitor
cs: Přesunout na pravý monitor

source: Toggle fullscreen
cs: Přepnout režim na celou obrazovku

source: Toggle 'Always on top'
cs: Přepnout "Vždy nahoře"

source: Tile left
cs: Dlaždice vlevo

source: Tile right
cs: Dlaždice vpravo

source: Tile top
cs: Dlaždice nahoře

source: Tile bottom
cs: Dlaždice dole

source: Tile top-left
cs: Dlaždice nahoře vlevo

source: Tile top-right
cs: Dlaždice nahoře vpravo

source: Tile bottom-left
cs: Dlaždice dole vlevo

source: Tile bottom-right
cs: Dlaždice dole vpravo

source: Layout name...
cs: Název rozložení...

source: Set a keybinding by clicking the 'Disabled' text. Enter the dimensions of the rectangles for the layouts in the left column.The right column shows a preview of your layouts (after saving). The layouts file is saved in $XDG_CONFIG_HOME/tiling-assistant/layouts.json. Format for the rectangles: xVal--yVal--widthVal--heightVal--dynamicSplit The values can range from 0 to 1. (0,0) is the top-left corner of your screen. (1,1) is the bottom-right corner. '--dynamicSplit' is optional and can be '--h' or '--v'. 'dynamicSplit' means you can tile any number of windows in that rectangle and they will share that space evenly (for ex.: Master & Stack). You can attach an app to the rectangle row. If you do that, a new instance of the app will be opened, when activating the layout. This is experimental and may not work reliably (especially on Wayland).
cs: Nastavte klávesovou zkratku kliknutím na text "Disabled". V levém sloupci zadejte rozměry obdélníků pro rozvržení.V pravém sloupci se zobrazí náhled vašich rozvržení (po uložení). Soubor s rozvrženími je uložen v adresáři $XDG_CONFIG_HOME/tiling-assistant/layouts.json. Formát obdélníků: xVal--yVal--widthVal--heightVal--dynamicSplit Hodnoty se mohou pohybovat od 0 do 1. (0,0) je levý horní roh obrazovky. (1,1) je pravý dolní roh. Parametr "--dynamicSplit" je nepovinný a může mít hodnotu "--h" nebo "--v". "DynamicSplit" znamená, že do tohoto obdélníku můžete rozdělit libovolný počet oken, která se o tento prostor rovnoměrně podělí (např.: Master & Stack). K řádku obdélníku můžete připojit aplikaci. Pokud to uděláte, při aktivaci rozložení se otevře nová instance aplikace. Jedná se o experimentální řešení, které nemusí fungovat spolehlivě (zejména v systému Wayland).

source: No layout preview...
cs: Žádný náhled rozložení...

source: Can't resize into that direction. Super + Directions resizes on the S and E side. Super + Shift + Directions on the N and W side.
cs: Nelze změnit velikost v tomto směru. Super + Směry mění velikost na J a V. Super + Shift + Směry na straně S a Z.

source: Layouts: App not found.
cs: Rozložení: Aplikace nenalezena.

source: No valid layouts defined.
cs: Nebylo definováno žádné validní rozložení.

source: Type to search...
cs: Vyhledávejte psaním...

source: No layout name...
cs: Žádný název rozložení...

source: Tile to left
cs: Dlaždice vlevo

source: Tile to right
cs: Dlaždice vpravo

source: Tile to top
cs: Dlaždice nahoře

source: Tile to bottom
cs: Dlaždice dole

source: Tile to top-left
cs: Dlaždice nahoře vlevo

source: Tile to top-right
cs: Dlaždice nahoře vpravo

source: Tile to bottom-left
cs: Dlaždice dole vlevo

source: Tile to bottom-right
cs: Dlaždice dole vpravo

source: Tiling Popup
cs: Vyskakovací okno dlaždic

source: Raise Tile Groups together
cs: Zvedání skupin dlaždic dohromady

source: Focus and Tiling
cs: Zaměření a dlaždice

source: The shortcuts to maximize and tile to the top, bottom, left, and right will tile the window, if it isn't tiled. Otherwise it will switch focus to the closest tiled window, if there is one.
cs: Klávesové zkratky pro maximalizaci a dlaždice nahoře, dole, vlevo a vpravo přepne okno na dlaždici, pokud ještě není dlaždicí. V opačném případě přepne zaměření na nejbližší dlaždicové okno, pokud nějaké existuje.

source: Tile Editing Mode: Focus Color
cs: Režim úpravy dlaždic: Barva zaměření

source: Window Gaps
cs: Mezery mezi okny

source: Gaps on Maximized Windows
cs: Mezery kolem maximalizovaných oknen

source: Restore Window Size on
cs: Obnovit velikost okna na

source: This setting is intended for Wayland users. Tiled windows may not properly restore their size when they are being grabbed on Wayland. If that is the case, you can try 'Restore Window Size on Grab End' instead.
cs: Toto nastavení je určeno pro uživatele systému Wayland. Dlaždicová okna nemusí správně obnovit svou velikost, když jsou uchopována na Waylandu. V takovém případě můžete místo toho vyzkoušet "Obnovit velikost okna na konci uchopení".

source: Grab Start
cs: začátku uchopení

source: Grab End
cs: konci uchopení

source: <u>Inverse Top Screen Edge Action:</u>
cs: <u>Inverzní akce horního okraje obrazovky:</u>

source: Landscape Displays
cs: Displeje na šířku

source: Portrait Displays
cs: Displeje na výšku

source: General
cs: Obecné

source: Toggle 'Tiling Popup'
cs: Přepnout "Vyskakovací okno dlaždic"

source: Tile Editing Mode
cs: Režim úprav dlaždic

source: Layout Selector
cs: Výběr rozvržení

source: Auto-Tile
cs: Automatické dlaždice

source: The focused window will try to fill the free screen space as good as possible based on the tiled windows around it. If there is no space, the window will either untile or maximize depending on wether it's currently tiled.
cs: Zaměřené okno se bude snažit co nejlépe vyplnit volný prostor na obrazovce na základě okolních oken s dlaždicemi. Pokud není místo, okno se buď přepne z dlaždice, nebo se maximalizuje v závislosti na tom, zda je právě dlaždicí.

source: Toggle Maximization
cs: Přepnout maximalizaci

source: <b> General </b>
cs: <b> Obecné </b>

source: Toggle to Top
cs: Přepnout nahoru

source: Toggle to Bottom
cs: Přepnout dolů

source: Toggle to Left
cs: Přepnout vlevo

source: Toggle to Right
cs: Přepnout vpravo

source: <b> Side Tiling </b>
cs: <b> Dlaždice na straně </b>

source: Toggle to Top-Left
cs: Přepnout nahoru vlevo

source: Toggle to Top-Right
cs: Přepnout nahoru vpravo

source: Toggle to Bottom-Left
cs: Přepnout dolů vlevo

source: Toggle to Bottom-Right
cs: Přepnout dolů vpravo

source: <b> Corner Tiling </b>
cs: <b> Dlaždice v rohu </b>

source: Keybindings
cs: Klávesové zkratky

source: Layouts
cs: Rozložení

source: Tiling Assistant
cs: Asistent dlaždicování

source: If you want to report a bug or need help, please open an issue on Github.
cs: Pokud chcete nahlásit chybu, nebo potřebujete pomoc, prosím vytvořte issue na GitHubu.

source: The <big><b>README</b></big> offers a detailed explaination of every setting and feature.
cs: <big><b>README</b></big> nabízí detailní vysvětlení každého nastavení a funkce.

source: The <big><b>Changelog</b></big> lists the changes made between each extension version.
cs: <big><b>Changelog</b></big> obsahuje seznam změn provedené mezi jednotlivými verzemi rozšíření.

source: <small>This extension is licensed under the <a href='https://www.gnu.org/licenses/old-licenses/gpl-2.0.html'>GNU General Public License, version 2 or later</a> and comes with <u><b>NO WARRANTY</b></u>. A copy of this license can be found in the Github repository.</small>
cs: <small>Toto rozšíření je licencováno pod <a href='https://www.gnu.org/licenses/old-licenses/gpl-2.0.html'>GNU General Public License, verze 2 nebo novější</a> a není dodáváno s <u><b>ŽÁDNOU ZÁRUKOU</b></u>. Kopii této licence naleznete v repozitáři na GitHubu.</small>

source: Help and Changelog
cs: Nápověda a Changelog

source: <u><b>Hidden Settings</b></u>
cs: <u><b>Skrytá nastavení</b></u>

source: Tiling Popup: Current Workspace only
cs: Vyskakovací okno dlaždic: Pouze aktuální pracovní plocha

source: Tile Animations
cs: Animace dlaždicování

source: Untile Animations
cs: Animace zrušení dlaždicování

source: Inverse Top Screen Edge Action Timer
cs: Inverzní časovač akce horního okraje obrazovky
