Repository: 2br-2b/Tiling-Assistant
Catalog: tiling-assistant@leleat-on-github/po/*.po
Languages: de

source: Missing rectangle or app.
de: Fehlendes Rechteck oder App.

source: Rectangle %d is (partly) outside of the screen.
de: Rechteck %d befindet sich (teilweise) außerhalb des Bildschirms.

source: Rectangles %d and %d overlap.
de: Rechteck %d und %d überlappen sich.

source: General
de: Allgemein

source: Keybindings
de: Tastenkürzel

source: Help
de: Hilfe

source: Enable Dash
de: Benutze Dash

source: Dash icon size
de: Dash Icon Größe

source: Dash icon margin
de: Dash Icon Rand

source: Enable animations
de: Benutze Animationen

source: Gap between tiled windows
de: Abstand zwischen gekachelten Fenstern

source: Toggle maximization
de: Fenstermaximierung umschalten

source: Tile to top half
de: Kachel zur oberen Hälfte

source: Tile to bottom half
de: Kachel zur unteren Hälfte

source: Tile to right half
de: Kachel zur rechten Hälfte

source: Tile to left half
de: Kachel zur linken Hälfte

source: Tile to top left quarter
de: Kachel nach oben links

source: Tile to top right quarter
de: Kachel nach oben rechts

source: Tile to bottom left quarter
de: Kachel nach unten links

source: Tile to bottom right quarter
de: Kachel nach unten rechts

source: Tile to empty space
de: Kachel zum freien Platz

source: Tile to other tiled window
de: Kachel zu anderem gekacheltem Fenster

source: Toggle Dash
de: Schalte Dashnutzung um

source: <b> Fixed Tiling </b>
de: <b> Festes Kacheln </b>

source: <b> Dynamic Tiling </b>
de: <b> Dynamisches Kacheln </b>

source: <b> Other </b>
de: <b> Sonstiges </b>

source: If you want to report a bug or make a feature request, please open an issue on Github.
de: Falls du einen Bug melden möchtest oder einen Feature-Wunsch hast, öffne bitte ein Issue auf Github.

source: <small>This extension is licensed under the <a href='https://www.gnu.org/licenses/old-licenses/gpl-2.0.html'>GNU General Public License, version 2 or later</a> and comes with <u><b>NO WARRANTY</b></u>. A copy of this license can be found in the Github repository.</small>
de: <small>Diese Erweiterung wird mit der <a href='https://www.gnu.org/licenses/old-licenses/gpl-2.0.html'>GNU General Public License, version 2 oder später</a> entwickelt und bietet <u><b>KEINE GARANTIE</b></u>. Eine Kopie der Lizenz befindet sich auf Github.</small>

source: Even if this setting is turned off, not all move/resize animations will be disabled. Some are native to GNOME and thus unaffected by this setting.
de: Selbst wenn diese Einstellung deaktiviert ist, bedeutet es nicht, dass alle Fensterbewegungs-/-größenänderungsanimationen deaktiviert werden. Manche kommen von GNOME und bleiben daher von dieser Einstellung unberührt.

source: Save
de: Speichern

source: Reload
de: Neu laden

source: This tooltip for help...
de: Dieser Tooltip für Hilfe...

source: In the left column you will enter the dimensions of the rectangles for the layouts. Format is: xVal--yVal--widthVal--heightVal The values can range from 0 to 1. 1 represents your full screen's dimensions. For ex.: 0.5--0--.5--1 The right column shows a preview of your different layouts. Unsaved changes are not displayed. The reload button loads the layouts from your file (i. e. unsaved changes will be lost). The clear button clears the respective layout. This change is not yet saved. Layouts are saved in ~/.TilingAssistantExtension.layouts.json
de: In die linke Spalte kommen die Dimensionen der Rechtecke für die Layouts. Formatierung sieht wie folgt aus: xWert--yWert--breitenWert--höhenWert Die Werte liegen zwischen 0 und 1. 1 entspricht deiner gesamten Bildschirmseite. Z. B.: 0.5--0--.5--1 Die rechte Spalte zeigt dir eine Vorschau deiner Layouts. Nicht gespeicherte Veränderungen werden nicht angezeigt. Der Neu-laden-Button lädt die Layouts aus der Datei (d . h. nicht gespeicherte Veränderungen gehen verloren). Der jeweilige Lösch-Button löscht die Werte aus dem entsprechendem Layout. Diese Veränderung wird nicht automatisch gespeichert. Layouts werden in ~/.TilingAssistantExtension.layouts.json gespeichert.
